INSERT INTO rankings (program_id, ranking)
VALUES
  (7, 1),   -- ニュース速報1（視聴回数合計：870,000）
  (8, 2),   -- ニュース速報2（視聴回数合計：1,520,000）
  (13, 3),  -- バラエティショー1（視聴回数合計：735,000）
  (6, 4),   -- スポーツニュース1（視聴回数合計：570,000）
  (14, 5),  -- バラエティショー2（視聴回数合計：1,355,000）
  (11, 6),  -- ドキュメンタリー特集1（視聴回数合計：997,000）
  (12, 7),  -- ドキュメンタリー特集2（視聴回数合計：743,000）
  (9, 8),   -- 音楽ライブ1（視聴回数合計：645,000）
  (3, 9),   -- アニメ特集3（視聴回数合計：460,000）
  (4, 10),  -- ドラマ特集1（視聴回数合計：385,000）
  (5, 11),  -- ドラマ特集2（視聴回数合計：325,000）
  (1, 12),  -- アニメ特集1（視聴回数合計：475,000）
  (2, 13),  -- アニメ特集2（視聴回数合計：455,000）
  (10, 14); -- 音楽ライブ2（視聴回数合計：615,000）
